apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_sdcard.c
/* Let's wait until we have both SD card transfer complete and DMA
 * complete.
 */

#define SDCARD_XFRDONE_FLAG  (1)
#define SDCARD_DMADONE_FLAG  (2)
#define SDCARD_ALLDONE       (3)

/* Register logging support */

#ifdef CONFIG_DEBUG_MEMCARD_INFO
#  ifdef CONFIG_LPC17_40_SDCARD_DMA
#    define SAMPLENDX_BEFORE_SETUP  0
#    define SAMPLENDX_BEFORE_ENABLE 1
#    define SAMPLENDX_AFTER_SETUP   2
#    define SAMPLENDX_END_TRANSFER  3
#    define SAMPLENDX_DMA_CALLBACK  4
#    define DEBUG_NSAMPLES          5
#  else
#    define SAMPLENDX_BEFORE_SETUP  0
#    define SAMPLENDX_AFTER_SETUP   1
#    define SAMPLENDX_END_TRANSFER  2
#    define DEBUG_NSAMPLES          3
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure defines the state of the LPC17XX_40XX SD card interface */

struct lpc17_40_dev_s
{
  struct sdio_dev_s  dev;        /* Standard, base SD card interface */

  /* LPC17XX_40XX-specific extensions */

  /* Event support */

  sem_t              waitsem;         /* Implements event waiting */
  sdio_eventset_t    waitevents;      /* Set of events to be waited for */
  uint32_t           waitmask;        /* Interrupt enables for event waiting */
  volatile sdio_eventset_t wkupevent; /* The event that caused the wakeup */
  struct wdog_s      waitwdog;        /* Watchdog that handles event timeouts */

  /* Callback support */

  sdio_statset_t     cdstatus;   /* Card status */
  sdio_eventset_t    cbevents;   /* Set of events to be cause callbacks */
  worker_t           callback;   /* Registered callback function */
  void              *cbarg;      /* Registered callback argument */
  struct work_s      cbwork;     /* Callback work queue structure */

  /* Interrupt mode data transfer support */

  uint32_t          *buffer;     /* Address of current R/W buffer */
  size_t             remaining;  /* Number of bytes remaining in the transfer */
  uint32_t           xfrmask;    /* Interrupt enables for data transfer */

  /* DMA data transfer support */

  bool               widebus;    /* Required for DMA support */
#ifdef CONFIG_LPC17_40_SDCARD_DMA
  volatile uint8_t   xfrflags;   /* Used to synchronize SD card and DMA completion events */
  bool               dmamode;    /* true: DMA mode transfer */
  DMA_HANDLE         dma;        /* Handle for DMA channel */
#endif
};

/* Register logging support */

#ifdef CONFIG_DEBUG_MEMCARD_INFO
struct lpc17_40_sdcard_regs_s
{
  uint8_t  pwr;
  uint16_t clkcr;
  uint16_t dctrl;
  uint32_t dtimer;
  uint32_t dlen;
  uint32_t dcount;
  uint32_t sta;
  uint32_t mask;
  uint32_t fifocnt;
};

struct lpc17_40_sampleregs_s
{
  struct lpc17_40_sdcard_regs_s sdcard;
#if defined(CONFIG_DEBUG_DMA) && defined(CONFIG_LPC17_40_SDCARD_DMA)
  struct lpc17_40_dmaregs_s  dma;
#endif
};
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Low-level helpers ********************************************************/

static inline void lpc17_40_setclock(uint32_t clkcr);
static void lpc17_40_configwaitints(struct lpc17_40_dev_s *priv,
              uint32_t waitmask, sdio_eventset_t waitevents,
              sdio_eventset_t wkupevents);
static void lpc17_40_configxfrints(struct lpc17_40_dev_s *priv,
              uint32_t xfrmask);
static void lpc17_40_setpwrctrl(uint32_t pwrctrl);

/* DMA Helpers **************************************************************/

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static void lpc17_40_sampleinit(void);
static void lpc17_40_sdcard_sample(struct lpc17_40_sdcard_regs_s *regs);
static void lpc17_40_sample(struct lpc17_40_dev_s *priv, int index);
static void lpc17_40_sdcard_dump(struct lpc17_40_sdcard_regs_s *regs,
              const char *msg);
static void lpc17_40_dumpsample(struct lpc17_40_dev_s *priv,
              struct lpc17_40_sampleregs_s *regs, const char *msg);
static void lpc17_40_dumpsamples(struct lpc17_40_dev_s *priv);
#else
#  define   lpc17_40_sampleinit()
#  define   lpc17_40_sample(priv,index)
#  define   lpc17_40_dumpsamples(priv)
#endif

#ifdef CONFIG_LPC17_40_SDCARD_DMA
static void lpc17_40_dmacallback(DMA_HANDLE handle, void *arg, int status);
#endif

/* Data Transfer Helpers ****************************************************/

static uint8_t lpc17_40_log2(uint16_t value);
static void lpc17_40_dataconfig(uint32_t timeout, uint32_t dlen,
              uint32_t dctrl);
static void lpc17_40_datadisable(void);
static void lpc17_40_sendfifo(struct lpc17_40_dev_s *priv);
static void lpc17_40_recvfifo(struct lpc17_40_dev_s *priv);
static void lpc17_40_eventtimeout(wdparm_t arg);
static void lpc17_40_endwait(struct lpc17_40_dev_s *priv,
              sdio_eventset_t wkupevent);
static void lpc17_40_endtransfer(struct lpc17_40_dev_s *priv,
              sdio_eventset_t wkupevent);

/* Interrupt Handling *******************************************************/

static int  lpc17_40_interrupt(int irq, void *context, void *arg);

/* SD Card Interface Methods ************************************************/

/* Mutual exclusion */

#ifdef CONFIG_SDIO_MUXBUS
static int lpc17_40_lock(struct sdio_dev_s *dev, bool lock);
#endif

/* Initialization/setup */

static void lpc17_40_reset(struct sdio_dev_s *dev);
static sdio_capset_t lpc17_40_capabilities(struct sdio_dev_s *dev);
static uint8_t lpc17_40_status(struct sdio_dev_s *dev);
static void lpc17_40_widebus(struct sdio_dev_s *dev, bool enable);
static void lpc17_40_clock(struct sdio_dev_s *dev,
              enum sdio_clock_e rate);
static int  lpc17_40_attach(struct sdio_dev_s *dev);

/* Command/Status/Data Transfer */

static int  lpc17_40_sendcmd(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t arg);
static int  lpc17_40_recvsetup(struct sdio_dev_s *dev,
              uint8_t *buffer, size_t nbytes);
static int  lpc17_40_sendsetup(struct sdio_dev_s *dev,
              const uint8_t *buffer, size_t nbytes);
static int  lpc17_40_cancel(struct sdio_dev_s *dev);

static int  lpc17_40_waitresponse(struct sdio_dev_s *dev, uint32_t cmd);
static int  lpc17_40_recvshortcrc(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);
static int  lpc17_40_recvlong(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t rlong[4]);
static int  lpc17_40_recvshort(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);
static int  lpc17_40_recvnotimpl(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rnotimpl);

/* EVENT handler */

static void lpc17_40_waitenable(struct sdio_dev_s *dev,
              sdio_eventset_t eventset, uint32_t timeout);
static sdio_eventset_t lpc17_40_eventwait(struct sdio_dev_s *dev);
static void lpc17_40_callbackenable(struct sdio_dev_s *dev,
              sdio_eventset_t eventset);
static int  lpc17_40_registercallback(struct sdio_dev_s *dev,
              worker_t callback, void *arg);

/* DMA */

#ifdef CONFIG_LPC17_40_SDCARD_DMA
static int  lpc17_40_dmarecvsetup(struct sdio_dev_s *dev,
              uint8_t *buffer, size_t buflen);
static int  lpc17_40_dmasendsetup(struct sdio_dev_s *dev,
              const uint8_t *buffer, size_t buflen);
#endif

/* Initialization/uninitialization/reset ************************************/

static void lpc17_40_callback(void *arg);
static void lpc17_40_default(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct lpc17_40_dev_s g_scard_dev =
{
  .dev =
  {
#ifdef CONFIG_SDIO_MUXBUS
    .lock             = lpc17_40_lock,
#endif
    .reset            = lpc17_40_reset,
    .capabilities     = lpc17_40_capabilities,
    .status           = lpc17_40_status,
    .widebus          = lpc17_40_widebus,
    .clock            = lpc17_40_clock,
    .attach           = lpc17_40_attach,
    .sendcmd          = lpc17_40_sendcmd,
    .recvsetup        = lpc17_40_recvsetup,
    .sendsetup        = lpc17_40_sendsetup,
    .cancel           = lpc17_40_cancel,
    .waitresponse     = lpc17_40_waitresponse,
    .recv_r1          = lpc17_40_recvshortcrc,
    .recv_r2          = lpc17_40_recvlong,
    .recv_r3          = lpc17_40_recvshort,
    .recv_r4          = lpc17_40_recvnotimpl,
    .recv_r5          = lpc17_40_recvnotimpl,
    .recv_r6          = lpc17_40_recvshortcrc,
    .recv_r7          = lpc17_40_recvshort,
    .waitenable       = lpc17_40_waitenable,
    .eventwait        = lpc17_40_eventwait,
    .callbackenable   = lpc17_40_callbackenable,
    .registercallback = lpc17_40_registercallback,
#ifdef CONFIG_SDIO_DMA
#ifdef CONFIG_LPC17_40_SDCARD_DMA
    .dmarecvsetup     = lpc17_40_dmarecvsetup,
    .dmasendsetup     = lpc17_40_dmasendsetup,
#else
    .dmarecvsetup     = lpc17_40_recvsetup,
    .dmasendsetup     = lpc17_40_sendsetup,
#endif
#endif
  },
  .waitsem = SEM_INITIALIZER(0),
};

/* Register logging support */

#ifdef CONFIG_DEBUG_MEMCARD_INFO
static struct lpc17_40_sampleregs_s g_sampleregs[DEBUG_NSAMPLES];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Low-level Helpers
 ****************************************************************************/

/****************************************************************************
 * Name: lpc17_40_setclock
 *
 * Description:
 *   Modify oft-changed bits in the CLKCR register.  Only the following bit-
 *   fields are changed:
 *
 *   CLKDIV, PWRSAV, BYPASS, and WIDBUS
 *
 * Input Parameters:
 *   clkcr - A new CLKCR setting for the above mentions bits (other bits
 *           are ignored.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void lpc17_40_setclock(uint32_t clkcr)
{
  uint32_t regval = getreg32(LPC17_40_SDCARD_CLOCK);

  /* Clear CLKDIV, PWRSAV, BYPASS, and WIDBUS bits */

  regval &= ~(SDCARD_CLOCK_CLKDIV_MASK | SDCARD_CLOCK_PWRSAV |
              SDCARD_CLOCK_BYPASS | SDCARD_CLOCK_WIDBUS |
              SDCARD_CLOCK_CLKEN);

