apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_sdcard.c
  /* Reset the DPSM configuration */

  lpc17_40_datadisable();

  /* Wide bus operation is required for DMA */

  if (priv->widebus)
    {
      lpc17_40_sampleinit();
      lpc17_40_sample(priv, SAMPLENDX_BEFORE_SETUP);

      /* Save the source buffer information for use by the interrupt
       * handler.
       */

      priv->buffer    = (uint32_t *)buffer;
      priv->remaining = buflen;
      priv->dmamode   = true;

      /* Then set up the SD card data path */

      dblocksize = lpc17_40_log2(buflen) << SDCARD_DCTRL_DBLOCKSIZE_SHIFT;
      lpc17_40_dataconfig(SDCARD_DTIMER_DATATIMEOUT, buflen, dblocksize);

      /* Configure the TX DMA */

      ret = lpc17_40_dmasetup(priv->dma, SDCARD_TXDMA32_CONTROL,
                           SDCARD_TXDMA32_CONFIG, (uint32_t)buffer,
                           LPC17_40_SDCARD_FIFO, (buflen + 3) >> 2);
      if (ret == OK)
        {
          lpc17_40_sample(priv, SAMPLENDX_BEFORE_ENABLE);

          regval  = getreg32(LPC17_40_SDCARD_DCTRL);
          regval |= SDCARD_DCTRL_DMAEN;
          putreg32(regval, LPC17_40_SDCARD_DCTRL);

          /* Start the DMA */

          lpc17_40_dmastart(priv->dma, lpc17_40_dmacallback, priv);
          lpc17_40_sample(priv, SAMPLENDX_AFTER_SETUP);

          /* Enable TX interrupts */

          lpc17_40_configxfrints(priv, SDCARD_DMASEND_MASK);
        }
    }

  return ret;
}
#endif

/****************************************************************************
 * Initialization/uninitialization/reset
 ****************************************************************************/

/****************************************************************************
 * Name: lpc17_40_callback
 *
 * Description:
 *   Perform callback.
 *
 * Assumptions:
 *   This function does not execute in the context of an interrupt handler.
 *   It may be invoked on any user thread or scheduled on the work thread
 *   from an interrupt handler.
 *
 ****************************************************************************/

static void lpc17_40_callback(void *arg)
{
  struct lpc17_40_dev_s *priv = (struct lpc17_40_dev_s *)arg;

  /* Is a callback registered? */

  DEBUGASSERT(priv != NULL);
  mcinfo("Callback %p(%p) cbevents: %02x cdstatus: %02x\n",
         priv->callback, priv->cbarg, priv->cbevents, priv->cdstatus);

  if (priv->callback)
    {
      /* Yes.. Check for enabled callback events */

      if ((priv->cdstatus & SDIO_STATUS_PRESENT) != 0)
        {
          /* Media is present.  Is the media inserted event enabled? */

          if ((priv->cbevents & SDIOMEDIA_INSERTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }
      else
        {
          /* Media is not present.  Is the media eject event enabled? */

          if ((priv->cbevents & SDIOMEDIA_EJECTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }

      /* Perform the callback, disabling further callbacks.  Of course, the
       * the callback can (and probably should) re-enable callbacks.
       */

      priv->cbevents = 0;

      /* Callbacks cannot be performed in the context of an interrupt
       * handler. If we are in an interrupt handler, then queue the
       * callback to be performed later on the work thread.
       */

      if (up_interrupt_context())
        {
          /* Yes.. queue it */

           mcinfo("Queuing callback to %p(%p)\n", priv->callback,
                                                  priv->cbarg);
           work_queue(HPWORK, &priv->cbwork, priv->callback,
                      priv->cbarg, 0);
        }
      else
        {
          /* No.. then just call the callback here */

          mcinfo("Callback to %p(%p)\n", priv->callback, priv->cbarg);
          priv->callback(priv->cbarg);
        }
    }
}

/****************************************************************************
 * Name: lpc17_40_default
 *
 * Description:
 *   Restore SD card registers to their default, reset values
 *
 ****************************************************************************/

static void lpc17_40_default(void)
{
  putreg32(SDCARD_PWR_RESET,    LPC17_40_SDCARD_PWR);
  putreg32(SDCARD_CLOCK_RESET,  LPC17_40_SDCARD_CLOCK);
  putreg32(SDCARD_ARG_RESET,    LPC17_40_SDCARD_ARG);
  putreg32(SDCARD_CMD_RESET,    LPC17_40_SDCARD_CMD);
  putreg32(SDCARD_DTIMER_RESET, LPC17_40_SDCARD_DTIMER);
  putreg32(SDCARD_DLEN_RESET,   LPC17_40_SDCARD_DLEN);
  putreg32(SDCARD_DCTRL_RESET,  LPC17_40_SDCARD_DCTRL);
  putreg32(SDCARD_CLEAR_RESET,  LPC17_40_SDCARD_CLEAR);
  putreg32(SDCARD_MASK0_RESET,  LPC17_40_SDCARD_MASK0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sdio_initialize
 *
 * Description:
 *   Initialize SD card for operation.
 *
 * Input Parameters:
 *   slotno - Not used.
 *
 * Returned Value:
 *   A reference to an SD card interface structure.  NULL is returned on
 *   failures.
 *
 ****************************************************************************/

struct sdio_dev_s *sdio_initialize(int slotno)
{
  uint32_t   regval;

  /* There is only one slot */

  struct lpc17_40_dev_s *priv = &g_scard_dev;

  /* Enable power on SD Interface */

  regval  = getreg32(LPC17_40_SYSCON_PCONP);
  regval |= SYSCON_PCONP_PCSDC;
  putreg32(regval, LPC17_40_SYSCON_PCONP);

  /* Initialize the SD card slot structure */

#ifdef CONFIG_LPC17_40_SDCARD_DMA
  /* Configure the SDCARD DMA request */

  lpc17_40_dmaconfigure(DMA_REQ_SDCARD, DMA_DMASEL_SDCARD);

  /* Allocate a DMA channel for SDCARD DMA */

  priv->dma = lpc17_40_dmachannel();
  DEBUGASSERT(priv->dma);
#endif

  /* Configure GPIOs for 4-bit, wide-bus operation.
   *
   * If bus is multiplexed then there is a custom bus configuration utility
   * in the scope of the board support package.
   */

#ifndef CONFIG_SDIO_MUXBUS
  lpc17_40_configgpio(GPIO_SD_DAT0);
#ifndef CONFIG_LPC17_40_SDCARD_WIDTH_D1_ONLY
  lpc17_40_configgpio(GPIO_SD_DAT1);
  lpc17_40_configgpio(GPIO_SD_DAT2);
  lpc17_40_configgpio(GPIO_SD_DAT3);
#endif
  lpc17_40_configgpio(GPIO_SD_CLK);
  lpc17_40_configgpio(GPIO_SD_CMD);
#endif

